tap "jandedobbeleer/oh-my-posh"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# Command-line interface for 1Password
cask "1password-cli"
# Chromium based browser
cask "arc"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Laravel and PHP development environment manager
cask "herd"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# App wrapper for Postgres
cask "postgres-unofficial"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andys8.jest-snippets"
vscode "andyyaldoo.vscode-json"
vscode "anthropic.claude-code"
vscode "austenc.tailwind-docs"
vscode "bboure.vscode-appsync-utils"
vscode "bmewburn.vscode-intelephense-client"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "burkeholland.simple-react-snippets"
vscode "catppuccin.catppuccin-vsc"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "denoland.vscode-deno"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "fisheva.eva-theme"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hdoro.sanity-snippets"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "khaeransori.json2csv"
vscode "laravel.vscode-laravel"
vscode "mark-tucker.aws-cli-configure"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mklein.cdk-snippets"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "nhedger.inertia"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oliversturm.fix-json"
vscode "onecentlin.laravel5-snippets"
vscode "pabue.linear-theme"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "sanity-io.vscode-sanity"
vscode "saoudrizwan.claude-dev"
vscode "sburg.vscode-javascript-booster"
vscode "sdras.night-owl"
vscode "sebastianbille.iam-legend"
vscode "shopify.ruby-lsp"
vscode "shufo.vscode-blade-formatter"
vscode "sidthesloth.svg-snippets"
vscode "skyran.js-jsx-snippets"
vscode "sleistner.vscode-fileutils"
vscode "stivo.tailwind-fold"
vscode "sumitsaha.learn-with-sumit-theme"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
